### Merge DataFames

In [657]:
import pandas as pd

var1=pd.DataFrame({"A":[1,2,3,4],"B":[2,4,7,1]})
var2=pd.DataFrame({"A":[1,2,3,5],"C":[12,14,17,11]})

# print(var1)
# print(var2)

# pd.merge(var1,var2)

# pd.merge(var1,var2,on="A")

pd.merge(var1,var2,how="inner")

# var2

   A  B   C
0  1  2  12
1  2  4  14
2  3  7  17

In [658]:
var1=pd.DataFrame({"A":[1,2,3,6],"B":[2,4,7,1]})
var2=pd.DataFrame({"A":[1,2,3,5],"C":[12,14,17,11]})

pd.merge(var1,var2,how="left")
# pd.merge(var2,var1,how="right")
# pd.merge(var2,var1,how="outer")

   A  B     C
0  1  2  12.0
1  2  4  14.0
2  3  7  17.0
3  6  1   NaN

In [659]:
var1=pd.DataFrame({"A":[1,2,3,6],"B":[2,4,7,1]})

var2=pd.DataFrame({"A":[1,2,3,5],"B":[12,14,17,11]})

# pd.merge(var1,var2,left_index=True,right_index=True)
# pd.merge(var1,var2,left_index=True,right_index=True,suffixes=("python","java"))
pd.merge(var1,var2,left_index=True,right_index=True,suffixes=("-1","-2"))

   A-1  B-1  A-2  B-2
0    1    2    1   12
1    2    4    2   14
2    3    7    3   17
3    6    1    5   11

In [660]:
sr1=pd.Series([1,2,3,4,6])
sr2=pd.Series([11,12,13,14])

pd.concat([sr1,sr2])

0     1
1     2
2     3
3     4
4     6
0    11
1    12
2    13
3    14
dtype: int64

In [661]:
df1=pd.DataFrame({"A":[1,2,3,6],"B":[2,4,7,1]})

df2=pd.DataFrame({"A1":[1,2,3,5],"B1":[12,14,17,11]})

pd.concat([df1,df2])
pd.concat([df1,df2],axis=1)

   A  B  A1  B1
0  1  2   1  12
1  2  4   2  14
2  3  7   3  17
3  6  1   5  11

In [662]:
df1=pd.DataFrame({"A":[1,2,3,6],"B":[2,4,7,1]})
df2=pd.DataFrame({"A":[1,2],"B":[12,14]})

# pd.concat([df1,df2],axis=1,join="inner")

# pd.concat([df1,df2],axis=1,join="outer")

pd.concat([df1,df2],axis=1,join="outer",keys=["Data1","Data2"])

  Data1    Data2
      A  B     A     B
0     1  2   1.0  12.0
1     2  4   2.0  14.0
2     3  7   NaN   NaN
3     6  1   NaN   NaN

In [663]:
df1=pd.DataFrame({"A":[1,2,3,6]})
df2=pd.DataFrame({"A":[1,2],"B":[12,14]})

pd.concat([df1,df2],axis=1)

   A    A     B
0  1  1.0  12.0
1  2  2.0  14.0
2  3  NaN   NaN
3  6  NaN   NaN

In [664]:
df1=pd.DataFrame({"D":[1,2,3,6]})
df2=pd.DataFrame({"A":[1,2],"B":[12,14]})

pd.concat([df1,df2])

     D    A     B
0  1.0  NaN   NaN
1  2.0  NaN   NaN
2  3.0  NaN   NaN
3  6.0  NaN   NaN
0  NaN  1.0  12.0
1  NaN  2.0  14.0

In [665]:
import pandas as pd

newdf1=pd.DataFrame({
    "Name":["Rohit","Mohan","Rahul","Mohan","Rohit","Rahul","Rahul","Mohan","Rohit","Rahul","Mohan","Rahul"],
    "Maths":[12,34,56,56,45,54,34,87,96,55,33,98],
    "Science":[56,45,54,34,87,12,96,55,33,98,34,56]
})

newdf1

     Name  Maths  Science
0   Rohit     12       56
1   Mohan     34       45
2   Rahul     56       54
3   Mohan     56       34
4   Rohit     45       87
5   Rahul     54       12
6   Rahul     34       96
7   Mohan     87       55
8   Rohit     96       33
9   Rahul     55       98
10  Mohan     33       34
11  Rahul     98       56

In [666]:
varGp=newdf1.groupby("Name")

varGp

In [667]:
for key,value in varGp:
    print(key)
    print(value)
    print("----------------------------")

Mohan
     Name  Maths  Science
1   Mohan     34       45
3   Mohan     56       34
7   Mohan     87       55
10  Mohan     33       34
----------------------------
Rahul
     Name  Maths  Science
2   Rahul     56       54
5   Rahul     54       12
6   Rahul     34       96
9   Rahul     55       98
11  Rahul     98       56
----------------------------
Rohit
    Name  Maths  Science
0  Rohit     12       56
4  Rohit     45       87
8  Rohit     96       33
----------------------------

In [668]:
# varGp.get_group("Mohan")
varGp.get_group("Rohit")

    Name  Maths  Science
0  Rohit     12       56
4  Rohit     45       87
8  Rohit     96       33

In [669]:
varGp.min()

       Maths  Science
Name
Mohan     33       34
Rahul     34       12
Rohit     12       33

In [670]:
varGp.max()

       Maths  Science
Name
Mohan     87       55
Rahul     98       98
Rohit     96       87

In [671]:
varGp.mean()

       Maths    Science
Name
Mohan   52.5  42.000000
Rahul   59.4  63.200000
Rohit   51.0  58.666667

In [672]:
varGp.median()

       Maths  Science
Name
Mohan   45.0     39.5
Rahul   55.0     56.0
Rohit   45.0     56.0

In [673]:
list1=list(varGp)
list1

[('Mohan',
       Name  Maths  Science
  1   Mohan     34       45
  3   Mohan     56       34
  7   Mohan     87       55
  10  Mohan     33       34),
 ('Rahul',
       Name  Maths  Science
  2   Rahul     56       54
  5   Rahul     54       12
  6   Rahul     34       96
  9   Rahul     55       98
  11  Rahul     98       56),
 ('Rohit',
      Name  Maths  Science
  0  Rohit     12       56
  4  Rohit     45       87
  8  Rohit     96       33)]